package com.example.yuanassist.model

    // 🔴 修改点 1：增加 talents 字段，默认值为空 Map
    data class AgentAttr(
        val element: String,
        val profession: String,
        val talents: Map<Int, String> = emptyMap()
    )

    object AgentRepository {
        val ALL_AGENTS = arrayOf(
            "庞羲","马腾","诸葛亮","董奉","孔融","士燮","张绣","黄月英","满宠","张闿","贾诩","周瑜", "刘豹","令狐茂","夏侯惇",
            "陈登","张邈","张昭","张飞","诸葛瑾","诸葛诞","凌统","张燕","蒯越","程昱","张郃","安期","孙尚香","马超","戏学","甄宓","张角", "张鲁",
            "鲁肃","曹植","孙权","颜良","荀彧", "徐庶","王粲", "庞统",  "蔡琰",  "太史慈", "葛洪",
            "甘宁",  "荀攸", "黄盖", "祢衡","刘繇", "朱然",  "董白", "虞翻",
            "司马徽","蛾使","张修", "陆逊","史子眇","严白虎",  "张辽", "郭解",
            "吕蒙", "郭嘉", "华佗", "文丑", "阿蝉", "严颜", "杨修", "伍丹", "小乔", "许攸",
            "张仲景","关靖", "鸢使", "高览","甘缇", "崔烈", "山九","干吉", "雀使", "周群", "毛玠",
            "眭固", "绣球", "李脱", "楼班", "杨阜", "许曼","徐稺", "蜂使", "陆绩", "王异","李真","公孙珊","第五天", "飞云",
            "吕布","刘璋","夏侯渊","鄷公珠","鄷公玖","法正","庞德","SP陈登","SP史子渺","曹丕","程普","钟繇","蒯良","陈群","卢植","简雍","郭女王","周忠",

        )

        val AGENT_MAP = mapOf(
            "刘豹" to AgentAttr("水", "神纪",mapOf(1 to "橙雪霁初晴", 2 to "普攻伤害小幅增加", 3 to "橙大漠穷秋", 4 to "紫最大生命中幅提升", 5 to "攻击力小幅提升", 6 to "橙春风不度", 7 to "紫防御时恢复生命", 8 to "橙关山难越", 9 to "橙霜重鼓寒", 10 to "紫初始能量+1", 11 to "橙铁骑", 12 to "紫攻击力中幅提升")),
            "安期" to AgentAttr("地", "破军",mapOf(1 to "橙我独若遗", 2 to "橙攻击力大幅提升", 3 to "橙动而愈出", 4 to "橙取予然诺", 5 to "橙虚而不屈", 6 to "紫攻击力中幅提升", 7 to "紫防御时恢复生命", 8 to "紫初始能量+1", 9 to "紫最大生命中幅提升", 10 to "攻击力小幅提升", 11 to "普攻伤害小幅增加", 12 to "生命低时提升攻击")),
            "张燕" to AgentAttr("火", "神纪",mapOf(1 to "橙啊？", 2 to "橙啥？", 3 to "橙嗯", 4 to "橙噢", 5 to "橙攻击力大幅提升", 6 to "紫初始能量+1", 7 to "紫防御时恢复生命", 8 to "紫最大生命值中幅提升", 9 to "紫攻击力中幅提升", 10 to "生命高时攻击提升", 11 to "攻击力小幅提升", 12 to "最大生命小幅提升")),

            "董奉" to AgentAttr("阳", "岐黄", mapOf(
                1 to "橙植杏成丛", 2 to "橙着手成春", 3 to "橙扶正祛邪", 4 to "治疗效果小幅提升",
                5 to "橙随营医者", 6 to "最大生命小幅提升", 7 to "紫防御时恢复生命", 8 to "攻击力小幅提升",
                9 to "橙使用技能后防御", 10 to "紫治疗效果中幅提升", 11 to "紫攻击力中幅提升", 12 to "紫最大生命中幅提升"
            )),

            "贾诩" to AgentAttr("阴", "诡道",mapOf(1 to "橙技能伤害大幅增加", 2 to "橙初始能量+2", 3 to "橙冷酷毒计", 4 to "橙抽到吉时伤害提升", 5 to "紫普攻伤害中幅增加", 6 to "紫技能伤害中幅增加", 7 to "紫初始能量+1", 8 to "紫伤害转移次数提升", 9 to "技能不再消耗生命", 10 to "技能伤害小幅增加", 11 to "防御减伤提升", 12 to "普攻伤害小幅增加")),
            "马超" to AgentAttr("地", "破军",mapOf(1 to "紫普攻伤害中幅增加", 2 to "生命低时攻击提升", 3 to "橙以守为攻", 4 to "紫技能伤害中幅增加", 5 to "普攻伤害小幅增加", 6 to "橙西凉坚壁", 7 to "攻击力小幅提升", 8 to "橙铁骑当千", 9 to "紫防御时恢复生命", 10 to "紫攻击力中幅提升", 11 to "橙【嘲讽】回合提升", 12 to "橙出手法")),
            "孙尚香" to AgentAttr("火", "破军",mapOf(1 to "橙技能变为群体伤害", 2 to "橙普攻变为群体伤害", 3 to "紫普攻伤害中幅增加", 4 to "生命高时攻击提升", 5 to "技能伤害小幅增加", 6 to "橙暴击效果提升", 7 to "橙全队可以暴击", 8 to "防御减伤提升", 9 to "普攻伤害小幅增加", 10 to "紫防御时恢复生命", 11 to "紫技能伤害中幅增加", 12 to "紫初始能量+1")),
            "蔡琰" to AgentAttr("水", "诡道",mapOf(1 to "橙【记录】效果延长", 2 to "橙初始能量+2", 3 to "橙白水鉴心", 4 to "橙过目不忘", 5 to "紫初始能量+1", 6 to "紫防御时恢复生命", 7 to "紫普攻伤害中幅增加", 8 to "紫攻击力中幅提升", 9 to "防御减伤提升", 10 to "普攻伤害小幅增加", 11 to "生命高时攻击提升", 12 to "攻击力小幅提升")),

            "黄月英" to AgentAttr("阳", "龙盾", mapOf(
                1 to "橙羽化", 2 to "紫最大生命中幅提升", 3 to "橙山川妈妈", 4 to "橙尸解",
                5 to "橙乾坤既定", 6 to "攻击力小幅提升", 7 to "紫初始能量+1", 8 to "紫攻击力中幅提升",
                9 to "紫灵倾三台", 10 to "紫防御时恢复生命", 11 to "最大生命小幅提升", 12 to "橙应龙之盾"
            )),

            "夏侯惇" to AgentAttr("地", "龙盾",mapOf(1 to "橙拔矢啖睛", 2 to "橙陷阵护主", 3 to "橙进入战斗获得能量", 4 to "橙临机而变", 5 to "紫初始能量+1", 6 to "紫攻击力中幅提升", 7 to "紫防御时恢复生命", 8 to "紫普攻伤害中幅增加", 9 to "紫亲力亲为", 10 to "普攻伤害小幅增加", 11 to "防御减伤提升", 12 to "生命高时攻击提升")),
            "荀彧" to AgentAttr("风", "神纪",mapOf(1 to "橙辟雍三贤", 2 to "橙王佐之才", 3 to "橙机鉴先识", 4 to "橙明以举贤", 5 to "橙普攻技能护盾提升", 6 to "紫以攻为守", 7 to "紫居中持重", 8 to "紫回合开始回复生命", 9 to "攻击力小幅提升", 10 to "防御减伤提升", 11 to "生命高时攻击提升", 12 to "技能伤害小幅增加")),
            "周瑜" to AgentAttr("水", "神纪",mapOf(1 to "技能伤害小幅增加", 2 to "紫初始能量+1", 3 to "紫防御时恢复生命", 4 to "橙七弦音", 5 to "紫普攻伤害中幅增加", 6 to "紫技能伤害中幅增加", 7 to "防御减伤提升", 8 to "橙余音绕梁", 9 to "普攻伤害小幅增加", 10 to "橙琴式变换", 11 to "橙轻微淡远", 12 to "橙初始能量+2")),
            "徐庶" to AgentAttr("阳", "神纪",mapOf(1 to "橙谋无遗策", 2 to "橙技能后降低敌人抗性", 3 to "橙敌人较多时提升能力", 4 to "橙敌人较少时提升能力", 5 to "橙剑气纵横", 6 to "紫攻击力中幅提升", 7 to "紫技能伤害中幅增加", 8 to "紫青手力量偏向辅助", 9 to "紫最大生命中幅提升", 10 to "攻击力小幅提升", 11 to "技能伤害小幅增加", 12 to "生命高时攻击提升")),

            "张邈" to AgentAttr("风", "神纪", mapOf(
                1 to "橙初始能量+3", 2 to "紫普攻伤害中幅增加", 3 to "攻击力小幅提升", 4 to "紫初始能量+1",
                5 to "橙无晴却有晴", 6 to "紫最大生命中幅提升", 7 to "普攻伤害小幅增加", 8 to "橙道同为谋",
                9 to "橙风属性密探强化", 10 to "生命低时攻击提升", 11 to "紫攻击力中幅提升", 12 to "紫使用技能后防御"
            )),

            "张角" to AgentAttr("阴", "破军",mapOf(1 to "橙天宫", 2 to "橙黄天", 3 to "橙苍天", 4 to "橙符水", 5 to "橙反噬", 6 to "紫初始能量+1", 7 to "紫无极", 8 to "紫攻击力中幅提升", 9 to "紫布道", 10 to "普攻伤害小幅增加", 11 to "攻击力小幅提升", 12 to "生命低时攻击提升")),
            "诸葛瑾" to AgentAttr("水", "破军",mapOf(1 to "橙深沉穆远", 2 to "橙常棣", 3 to "橙岂无鹡鸰", 4 to "橙济威以仁", 5 to "橙寒霜拂矢", 6 to "紫随方就圆", 7 to "紫技能伤害中幅增加", 8 to "紫初始能量+1", 9 to "紫白露震霆", 10 to "生命低时攻击提升", 11 to "普攻伤害小幅增加", 12 to "技能伤害小幅增加")),
            "甄宓" to AgentAttr("火", "神纪",mapOf(1 to "橙暗线", 2 to "橙反戈", 3 to "橙压制", 4 to "橙最大生命大幅提升", 5 to "橙初始能量+3", 6 to "紫最大生命中幅提升", 7 to "紫防御时恢复生命", 8 to "紫初始能量+1", 9 to "紫攻击力中幅提升", 10 to "最大生命小幅提升", 11 to "攻击力小幅提升", 12 to "生命低时攻击提升")),
            "张飞" to AgentAttr("风", "破军",mapOf(1 to "橙断桥横矛", 2 to "橙风掣雷行", 3 to "橙普攻伤害大幅增加", 4 to "橙【死战】持续回合增加", 5 to "橙【悬赏】目标数增加", 6 to "紫初始能量+1", 7 to "紫普攻伤害中幅增加", 8 to "紫防御时恢复生命", 9 to "生命高时攻击提升", 10 to "防御减伤提升", 11 to "普攻伤害小幅增加", 12 to "技能伤害小幅增加")),
            "张闿" to AgentAttr("阴", "诡道",mapOf(1 to "橙技能触发持续伤害", 2 to "橙攻击力大幅提升", 3 to "紫普攻伤害中幅增加", 4 to "普攻伤害小幅增加", 5 to "橙初始能量+2", 6 to "紫最大生命中幅提升", 7 to "紫攻击力中幅提升", 8 to "生命低时攻击提升", 9 to "橙迅步潜影", 10 to "攻击力小幅提升", 11 to "紫防御时恢复生命", 12 to "橙飞镰横扫")),
            "张郃" to AgentAttr("火", "神纪",mapOf(1 to "橙火属性密探回复生命", 2 to "橙乘机应变", 3 to "橙治疗效果大幅提升", 4 to "橙使用技能后防御", 5 to "橙顺风扯旗", 6 to "紫治疗效果中幅提升", 7 to "紫攻击力中幅提升", 8 to "紫防御时恢复生命", 9 to "紫初始能量+1", 10 to "治疗效果小幅提升", 11 to "生命高时攻击提升", 12 to "攻击力小幅提升")),

            "士燮" to AgentAttr("水", "诡道", mapOf(
                1 to "橙战前赏赐", 2 to "最大生命小幅提升", 3 to "橙护盾效果大幅提升", 4 to "橙蕉叶覆鹿",
                5 to "橙交州之主", 6 to "紫最大生命中幅提升", 7 to "紫防御时恢复生命", 8 to "橙吃早茶",
                9 to "攻击力小幅提升", 10 to "紫初始能量+1", 11 to "紫攻击力中幅提升", 12 to "生命高时攻击提升"
            )),

            "孔融" to AgentAttr("水", "神纪", mapOf(
                1 to "紫攻击力中幅提升", 2 to "攻击力小幅提升", 3 to "紫初始能量+1", 4 to "橙普攻伤害大幅增加",
                5 to "橙君君臣臣", 6 to "橙包元履德", 7 to "紫普攻伤害中幅增加", 8 to "普攻伤害小幅增加",
                9 to "橙初始能量+4", 10 to "橙天道有常", 11 to "生命低时攻击提升", 12 to "紫防御时恢复生命"
            )),

            "凌统" to AgentAttr("火", "破军",mapOf(1 to "橙初始能量+3", 2 to "橙共愤同仇", 3 to "橙济河焚舟", 4 to "橙枕戈饮血", 5 to "橙声名烈烈", 6 to "橙最大生命大幅提升", 7 to "紫攻击力中幅提升", 8 to "紫防御时恢复生命", 9 to "紫最大生命中幅提升", 10 to "攻击力小幅提升", 11 to "生命低时提升攻击", 12 to "最大生命小幅提升")),

            "诸葛亮" to AgentAttr("阳", "神纪", mapOf(
                1 to "橙天命所归", 2 to "橙沟通天地", 3 to "紫初始能量+1", 4 to "橙飞龙在天",
                5 to "橙利见", 6 to "攻击力小幅提升", 7 to "紫最大生命中幅提升", 8 to "最大生命小幅提升",
                9 to "橙往来建木", 10 to "紫防御时恢复生命", 11 to "紫攻击力中幅提升", 12 to "生命高时攻击提升"
            )),

            "张绣" to AgentAttr("阴", "破军",mapOf(1 to "橙攻击力大幅提升", 2 to "橙骨饵犬狼", 3 to "橙孤阳偾", 4 to "橙磨牙吮血", 5 to "橙饥兽群嗥", 6 to "生命低时攻击提升", 7 to "紫初始能量+1", 8 to "紫防御时恢复生命", 9 to "紫最大生命值中幅提升", 10 to "紫攻击力中幅提升", 11 to "攻击力小幅提升", 12 to "普攻伤害小幅增加")),
            "满宠" to AgentAttr("阴", "破军",mapOf(1 to "橙幽明参半", 2 to "橙攻击力大幅提升", 3 to "橙威刑肃物", 4 to "橙刚骨离髓", 5 to "橙最大生命大幅提升", 6 to "橙严正判决", 7 to "紫最大生命中幅提升", 8 to "紫防御时恢复生命", 9 to "紫攻击力中幅提升", 10 to "最大生命小幅提升", 11 to "攻击力小幅提升", 12 to "生命低时攻击提升")),
            "张昭" to AgentAttr("风", "神纪",mapOf(1 to "橙初始能量+3", 2 to "橙维山崔嵬", 3 to "橙八风回", 4 to "橙肃杀", 5 to "橙萧瑟", 6 to "紫攻击力中幅提升", 7 to "紫防御时恢复生命", 8 to "紫初始能量+1", 9 to "紫普攻伤害中幅增加", 10 to "普攻伤害小幅增加", 11 to "生命低时攻击提升", 12 to "攻击力小幅提升")),
            "王粲" to AgentAttr("水", "神纪",mapOf(1 to "橙【同生共死】回合增加", 2 to "橙技能提供护盾", 3 to "橙技能消耗能量-1", 4 to "橙提升全队攻击但受伤提升", 5 to "紫初始能量+1", 6 to "紫治疗效果中幅提升", 7 to "紫攻击力中幅提升", 8 to "紫回合结束回复血量", 9 to "攻击力小幅提升", 10 to "防御减伤提升", 11 to "普攻伤害小幅增加", 12 to "生命高时攻击提升")),
            "孙权" to AgentAttr("火", "龙盾",mapOf(1 to "橙受击时获得减伤", 2 to "橙防御时嘲讽并减伤", 3 to "橙释放技能后获得剑", 4 to "橙技能额外强化", 5 to "紫防御时恢复生命", 6 to "紫技能伤害中幅增加", 7 to "紫初始能量+1", 8 to "紫攻击力中幅提升", 9 to "生命低时攻击提升", 10 to "防御减伤提升", 11 to "技能伤害小幅增加", 12 to "攻击力小幅提升")),
            "令狐茂" to AgentAttr("水", "神纪",mapOf(1 to "橙长生亦苦", 2 to "橙去日苦多", 3 to "橙初始能量+4", 4 to "橙灵河有源", 5 to "橙石上三生", 6 to "橙历世长存", 7 to "紫初始能量+1", 8 to "紫最大生命值中幅提升", 9 to "紫攻击力中幅提升", 10 to "生命低时攻击提升", 11 to "攻击力小幅提升", 12 to "普攻伤害小幅增加")),
            "刘繇" to AgentAttr("水", "诡道",mapOf(1 to "橙兔死狗烹", 2 to "橙天命在身", 3 to "橙千金市骨", 4 to "橙等量齐观", 5 to "橙渊图远算", 6 to "橙攻击力大幅提升", 7 to "紫攻击力中幅提升", 8 to "紫防御时恢复生命", 9 to "紫最大生命中幅提升", 10 to "攻击力小幅提升", 11 to "生命低时提升攻击", 12 to "最大生命小幅提升")),
            "蒯越" to AgentAttr("火", "神纪",mapOf(1 to "橙初始能量+3", 2 to "橙为王前驱", 3 to "橙营营何求", 4 to "橙沧海可越", 5 to "橙翼翼上弼", 6 to "紫初始能量+1", 7 to "紫防御时恢复生命", 8 to "紫最大生命值中幅提升", 9 to "紫攻击力中幅提升", 10 to "生命低时攻击提升", 11 to "攻击力小幅提升", 12 to "普攻伤害小幅增加")),
            "程昱" to AgentAttr("火", "诡道",mapOf(1 to "橙知止不殆", 2 to "紫技能伤害中幅增加", 3 to "橙明哲保身", 4 to "橙等价交换", 5 to "防御减伤提升", 6 to "紫攻击力中幅提升", 7 to "生命高时攻击提升", 8 to "技能伤害小幅增加", 9 to "紫防御时恢复生命", 10 to "紫初始能量+1", 11 to "橙审时度势", 12 to "橙血肉阴谋")),
            "诸葛诞" to AgentAttr("火", "神纪",mapOf(1 to "橙吹火吐焰", 2 to "橙双生", 3 to "橙笳鼓喧喧", 4 to "橙同气连枝", 5 to "橙折冲御侮", 6 to "紫攻击力中幅提升", 7 to "紫防御时恢复生命", 8 to "紫初始能量+1", 9 to "紫最大生命中幅提升", 10 to "最大生命小幅提升", 11 to "攻击力小幅提升", 12 to "普攻伤害小幅增加")),
            "曹植" to AgentAttr("风", "诡道",mapOf(1 to "橙技能伤害大幅增加", 2 to "橙音义既远", 3 to "橙初始能量+3", 4 to "橙洒落赋韵", 5 to "橙亲交从游", 6 to "紫攻击力中幅提升", 7 to "紫技能伤害中幅增加", 8 to "紫初始能量+1", 9 to "紫最大生命中幅提升", 10 to "生命低时攻击提升", 11 to "技能伤害小幅增加", 12 to "普攻伤害小幅增加")),
            "杨修" to AgentAttr("阳", "神纪",mapOf(1 to "橙初始能量+2", 2 to "橙队长技额外强化", 3 to "橙普攻概率回复能量", 4 to "橙技能伤害大幅增加", 5 to "橙技能额外效果", 6 to "紫初始能量+1", 7 to "紫普攻伤害中幅增加", 8 to "紫技能伤害中幅增加", 9 to "技能伤害小幅增加", 10 to "普攻伤害小幅增加", 11 to "生命高时攻击提升", 12 to "防御减伤提升")),
            "戏学" to AgentAttr("地", "诡道",mapOf(1 to "橙初始能量+4", 2 to "橙捉生替死", 3 to "橙气谊相投", 4 to "橙分身降低免伤值", 5 to "橙膏泽丰壤", 6 to "紫攻击力中幅提升", 7 to "紫防御时恢复生命", 8 to "紫初始能量+1", 9 to "紫最大生命中幅提升", 10 to "攻击力小幅提升", 11 to "普攻伤害小幅增加", 12 to "生命低时提升攻击")),
            "张鲁" to AgentAttr("阴", "诡道",mapOf(1 to "橙斩灭尸", 2 to "橙夺纪夺算", 3 to "橙技能伤害大幅增加", 4 to "橙伐身害命", 5 to "橙阴属性密探强化", 6 to "紫与张修联动", 7 to "紫初始能量+1", 8 to "紫攻击力中幅提升", 9 to "紫技能伤害中幅增加", 10 to "生命低时攻击提升", 11 to "技能伤害小幅增加", 12 to "普攻伤害小幅增加")),
            "黄盖" to AgentAttr("阴", "诡道",mapOf(1 to "橙攻击力大幅提升", 2 to "橙敌明我暗", 3 to "橙刃出封喉", 4 to "橙斑子", 5 to "橙声如洪钟", 6 to "紫最大生命中幅提升", 7 to "紫攻击力中幅提升", 8 to "紫防御时恢复生命", 9 to "紫初始能量+1", 10 to "攻击力小幅提升", 11 to "生命低时提升攻击", 12 to "普攻伤害小幅增加")),
            "陆逊" to AgentAttr("火", "破军",mapOf(1 to "橙技能消耗降低", 2 to "橙敌人较少时提升能力", 3 to "橙技能消耗提升但效果更强", 4 to "橙烈火同心", 5 to "紫防御时恢复生命", 6 to "紫初始能量+1", 7 to "紫技能伤害中幅增加", 8 to "紫普攻伤害中幅增加", 9 to "生命高时攻击提升", 10 to "普攻伤害小幅增加", 11 to "技能伤害小幅增加", 12 to "防御减伤提升")),
            "鲁肃" to AgentAttr("水", "诡道",mapOf(1 to "橙普攻伤害大幅增加", 2 to "橙技能劝退概率提升", 3 to "橙技能伤害大幅增加", 4 to "紫技能伤害中幅增加", 5 to "紫普攻伤害中幅增加", 6 to "紫普攻技能伤害增加", 7 to "紫初始能量+1", 8 to "紫生命高时攻击提升", 9 to "防御减伤提升", 10 to "普攻伤害小幅增加", 11 to "技能伤害小幅增加", 12 to "生命低时攻击提升")),
            "张修" to AgentAttr("火", "诡道",mapOf(1 to "橙敌人死亡提升攻击", 2 to "橙技能消耗能量降低", 3 to "橙强化生存能力", 4 to "橙队长技额外强化", 5 to "紫普攻技能伤害增加", 6 to "紫初始能量+1", 7 to "紫普攻伤害中幅增加", 8 to "紫攻击力中幅提升", 9 to "生命高时攻击提升", 10 to "攻击力小幅提升", 11 to "防御减伤提升", 12 to "普攻伤害小幅增加")),
            "虞翻" to AgentAttr("阴", "破军",mapOf(1 to "橙紧带断腰", 2 to "橙攻其不备", 3 to "橙节食", 4 to "橙右鬼非命", 5 to "橙攻击力大幅提升", 6 to "紫初始能量+1", 7 to "紫防御时恢复生命", 8 to "紫最大生命值中幅提升", 9 to "紫攻击力中幅提升", 10 to "生命高时攻击提升", 11 to "攻击力小幅提升", 12 to "最大生命小幅提升")),
            "张辽" to AgentAttr("地", "破军",mapOf(1 to "橙无路可退", 2 to "橙技能也能获得连击", 3 to "橙技能效果所需连击降低", 4 to "橙追加攻击概率提升", 5 to "紫初始能量+1", 6 to "紫攻击力中幅提升", 7 to "紫队长技强化", 8 to "紫普攻伤害中幅增加", 9 to "攻击力小幅提升", 10 to "普攻伤害小幅增加", 11 to "防御减伤提升", 12 to "生命低时提升攻击")),
            "华佗" to AgentAttr("阳", "岐黄",mapOf(1 to "橙悬壶济世", 2 to "橙提升攻击降低治疗", 3 to "橙弃医从武", 4 to "橙神纪岐黄伤害提升", 5 to "紫攻击力中幅提升", 6 to "紫最大生命中幅提升", 7 to "紫初始能量+1", 8 to "紫治疗效果提升", 9 to "生命高时攻击提升", 10 to "攻击力小幅提升", 11 to "最大生命小幅提升", 12 to "防御减伤提升")),
            "张仲景" to AgentAttr("地", "岐黄",mapOf(1 to "橙额外附加济世", 2 to "橙普攻后附加护盾", 3 to "橙技能额外选择目标", 4 to "橙治疗效果大幅提升", 5 to "橙队长技提供减伤", 6 to "紫治疗效果中幅提升", 7 to "紫最大生命中幅提升", 8 to "紫初始能量+1", 9 to "最大生命小幅提升", 10 to "生命高时攻击提升", 11 to "治疗效果小幅提升", 12 to "防御减伤提升")),
            "于吉" to AgentAttr("火", "诡道",mapOf(1 to "橙攻击力大幅提升", 2 to "橙死亡后更快复活", 3 to "橙强化普攻", 4 to "橙强化技能", 5 to "紫初始能量+1", 6 to "紫普攻伤害中幅增加", 7 to "紫普攻技能伤害增加", 8 to "紫攻击力中幅提升", 9 to "攻击力小幅提升", 10 to "防御减伤提升", 11 to "普攻伤害小幅增加", 12 to "生命低时提升攻击")),
            "郭嘉" to AgentAttr("风", "诡道",mapOf(1 to "橙普攻变为群体攻击", 2 to "橙遗计", 3 to "橙普攻伤害大幅增加", 4 to "橙奇袭计", 5 to "紫技能伤害中幅增加", 6 to "紫技能不再消耗生命", 7 to "紫普攻伤害中幅增加", 8 to "紫初始能量+1", 9 to "生命低时攻击提升", 10 to "技能伤害小幅增加", 11 to "防御减伤提升", 12 to "普攻伤害小幅增加")),
            "郭解" to AgentAttr("火", "龙盾",mapOf(1 to "橙受攻降低敌人攻击", 2 to "橙反击概率提升，次数降低", 3 to "橙普攻后获得护盾", 4 to "橙变阵", 5 to "紫初始能量+1", 6 to "紫技能伤害中幅增加", 7 to "紫郭解不会再退场", 8 to "紫普攻伤害中幅增加", 9 to "普攻伤害小幅增加", 10 to "生命低时攻击提升", 11 to "防御减伤提升", 12 to "技能伤害小幅增加")),
            "葛洪" to AgentAttr("阴", "诡道",mapOf(1 to "橙技能后防御并回复", 2 to "橙阴属性密探强化", 3 to "橙狡兔三窟", 4 to "橙技能消耗降低但伤害降低", 5 to "紫最大生命中幅提升", 6 to "紫初始能量+1", 7 to "紫技能伤害中幅增加", 8 to "紫普攻伤害中幅增加", 9 to "生命高时攻击提升", 10 to "普攻伤害小幅增加", 11 to "防御减伤提升", 12 to "技能伤害小幅增加")),
            "司马徽" to AgentAttr("阴", "诡道",mapOf(1 to "橙皋涂山", 2 to "橙白泽", 3 to "橙毕方", 4 to "橙鹿蜀", 5 to "紫最大生命中幅提升", 6 to "紫防御时恢复生命", 7 to "紫普攻伤害中幅增加", 8 to "紫攻击力中幅提升", 9 to "攻击力小幅提升", 10 to "防御减伤提升", 11 to "最大生命小幅提升", 12 to "生命高时攻击提升")),
            "太史慈" to AgentAttr("风", "破军",mapOf(1 to "橙新订单-合力攻击", 2 to "橙新订单-禁止防御", 3 to "橙绩效激励", 4 to "橙攻击力大幅提升", 5 to "橙时间规划", 6 to "紫攻击力中幅提升", 7 to "紫普攻伤害中幅增加", 8 to "紫防御时恢复生命", 9 to "紫技能伤害中幅增加", 10 to "普攻伤害小幅增加", 11 to "攻击力小幅提升", 12 to "生命低时攻击提升")),
            "朱然" to AgentAttr("阳", "龙盾",mapOf(1 to "橙汤池之固", 2 to "橙至刚至阳", 3 to "橙临危不挠", 4 to "橙攻击力大幅提升", 5 to "橙强御不畏", 6 to "紫初始能量+1", 7 to "紫最大生命中幅提升", 8 to "紫攻击力中幅提升", 9 to "紫防御时恢复生命", 10 to "攻击力小幅提升", 11 to "生命低时提升攻击", 12 to "最大生命小幅提升")),
            "庞统" to AgentAttr("阳", "神纪",mapOf(1 to "橙雅兴内融", 2 to "橙鹦鹉学舌", 3 to "橙鹦鹉投蛋伤害提升", 4 to "橙普攻变为群体伤害", 5 to "紫初始能量+1", 6 to "紫技能伤害中幅增加", 7 to "紫防御时恢复生命", 8 to "紫普攻伤害中幅增加", 9 to "防御减伤提升", 10 to "技能伤害小幅增加", 11 to "生命高时攻击提升", 12 to "普攻伤害小幅增加")),
            "董白" to AgentAttr("地", "神纪",mapOf(1 to "橙观衅而动", 2 to "橙最大生命大幅提升", 3 to "橙迄可休息", 4 to "橙窅窅翳翳", 5 to "橙发踪指示", 6 to "紫防御时恢复生命", 7 to "紫最大生命值中幅提升", 8 to "紫攻击力中幅提升", 9 to "紫初始能量+1", 10 to "普攻伤害小幅增加", 11 to "生命低时攻击提升", 12 to "最大生命小幅提升")),
            "荀攸" to AgentAttr("地", "诡道",mapOf(1 to "橙于无声处", 2 to "橙惊雷低声", 3 to "橙一智谋众", 4 to "橙初始能量+3", 5 to "橙隐幕", 6 to "紫初始能量+1", 7 to "紫防御时恢复生命", 8 to "紫技能伤害中幅增加", 9 to "紫攻击力中幅提升", 10 to "攻击力小幅提升", 11 to "普攻伤害小幅增加", 12 to "生命低时攻击提升")),
            "甘宁" to AgentAttr("水", "诡道",mapOf(1 to "橙掠夺攻击力", 2 to "橙坐享其成", 3 to "橙巧取豪夺", 4 to "橙同流合污", 5 to "橙穷凶极恶", 6 to "紫最大生命中幅提升", 7 to "紫技能伤害中幅增加", 8 to "紫普攻伤害中幅增加", 9 to "紫防御时恢复生命", 10 to "生命高时攻击提升", 11 to "技能伤害小幅增加", 12 to "普攻伤害小幅增加")),
            "祢衡" to AgentAttr("阳", "神纪",mapOf(1 to "橙初始能量+4", 2 to "橙普攻伤害大幅增加", 3 to "橙伐竹为枪", 4 to "橙英明神武", 5 to "橙风紧扯呼", 6 to "橙游放心狂", 7 to "紫初始能量+1", 8 to "紫防御时恢复生命", 9 to "紫最大生命值中幅提升", 10 to "紫攻击力中幅提升", 11 to "攻击力小幅提升", 12 to "普攻伤害小幅增加")),
            "吕蒙" to AgentAttr("火", "破军",mapOf(1 to "橙初始能量+2", 2 to "橙鼓舞", 3 to "橙红莲蓄力", 4 to "橙一触即发", 5 to "紫普攻伤害中幅增加", 6 to "紫防御时恢复生命", 7 to "紫技能伤害中幅增加", 8 to "紫初始能量+1", 9 to "技能伤害小幅增加", 10 to "普攻伤害小幅增加", 11 to "防御减伤提升", 12 to "生命高时攻击提升")),
            "颜良" to AgentAttr("水", "龙盾",mapOf(1 to "橙最大生命大幅提升", 2 to "橙攻击恢复生命", 3 to "橙普攻伤害大幅增加", 4 to "紫最大生命中幅提升", 5 to "紫援护概率提升", 6 to "紫初始能量+1", 7 to "紫普攻伤害中幅增加", 8 to "普攻伤害小幅增加", 9 to "防御减伤提升", 10 to "最大生命小幅提升", 11 to "生命高时提升攻击", 12 to "生命低时提升攻击")),
            "史子渺" to AgentAttr("风", "岐黄",mapOf(1 to "橙治疗效果大幅提升", 2 to "橙最大生命大幅提升", 3 to "橙技能提供减伤", 4 to "紫治疗效果中幅提升", 5 to "紫初始能量+1", 6 to "紫最大生命中幅提升", 7 to "紫防御时恢复生命", 8 to "生命低时提升攻击", 9 to "最大生命小幅提升", 10 to "治疗效果小幅提升", 11 to "生命高时提升攻击", 12 to "防御减伤提升")),

            "陈登" to AgentAttr("风", "神纪", mapOf(
                1 to "紫初始能量+2", 2 to "橙最大生命大幅提升", 3 to "防御减伤提升", 4 to "生命低时提升攻击",
                5 to "初始能量+1", 6 to "最大生命小幅提升", 7 to "普攻伤害小幅增加", 8 to "生命高时提升攻击",
                9 to "橙普攻伤害大幅增加", 10 to "紫最大生命中幅提升", 11 to "紫普攻伤害中幅增加", 12 to "紫普攻强化，技能免伤提升"
            )),

            "阿蝉" to AgentAttr("地", "破军"),
            "王异" to AgentAttr("风", "龙盾",mapOf(1 to "橙普攻伤害大幅增加", 2 to "橙初始能量+2", 3 to "橙百击效果提升", 4 to "橙嘲讽效果提升", 5 to "紫防御时恢复生命", 6 to "紫初始能量+1", 7 to "紫攻击力中幅提升", 8 to "紫普攻伤害中幅增加", 9 to "生命高时攻击提升", 10 to "普攻伤害小幅增加", 11 to "防御减伤提升", 12 to "攻击力小幅提升")),
            "卢植" to AgentAttr("", "", mapOf(
                1 to "橙攻击力大幅提升", 2 to "橙初始能量+2", 3 to "橙玉盘珠落", 4 to "橙采薇遗歌",
                5 to "橙弦外余音", 6 to "紫防御时恢复生命", 7 to "紫初始能量+1", 8 to "紫最大生命中幅提升",
                9 to "紫攻击力中幅提升", 10 to "攻击力小幅提升", 11 to "最大生命小幅提升", 12 to "生命高时攻击提升"
            )),
            "庞德" to AgentAttr("", "", mapOf(
                1 to "橙惊云破阵", 2 to "橙抬棺决死", 3 to "橙苦击", 4 to "橙叱敌",
                5 to "橙死战不屈", 6 to "紫初始能量+1", 7 to "紫最大生命中幅提升", 8 to "紫攻击力中幅提升",
                9 to "普攻伤害小幅增加", 10 to "攻击力小幅提升", 11 to "最大生命小幅提升", 12 to "生命高时攻击提升"
            )),
            "鄷公珠" to AgentAttr("", "", mapOf(
                1 to "橙最大生命大幅提升", 2 to "橙维虺维蛇", 3 to "橙龙蛇之蛰", 4 to "橙月盈复魄",
                5 to "橙山灵护野", 6 to "橙瑶光贯月", 7 to "紫防御时恢复生命", 8 to "紫最大生命中幅提升",
                9 to "紫治疗效果中幅提升", 10 to "治疗效果小幅提升", 11 to "最大生命小幅提升", 12 to "生命高时攻击提升"
            )),
            "鄷公玖" to AgentAttr("", "", mapOf(
                1 to "橙攻击力大幅提升", 2 to "橙并曜中天", 3 to "橙换斗移星", 4 to "橙否尽泰来",
                5 to "橙杲杲日升", 6 to "橙五星归垣", 7 to "紫初始能量+1", 8 to "紫普攻强化，技能免伤提升",
                9 to "紫攻击力中幅提升", 10 to "攻击力小幅提升", 11 to "技能强化，普攻免伤提升", 12 to "生命低时攻击提升"
            )),
            "陈群" to AgentAttr("", "", mapOf(
                1 to "橙攻击力大幅提升", 2 to "橙伐谋", 3 to "橙守文持正", 4 to "橙宝篆浮烟",
                5 to "橙青烟鹊尾", 6 to "橙行药", 7 to "紫初始能量+1", 8 to "紫最大生命中幅提升",
                9 to "紫攻击力中幅提升", 10 to "攻击力小幅提升", 11 to "最大生命小幅提升", 12 to "生命高时攻击提升"
            )),
            "法正" to AgentAttr("", "", mapOf(
                1 to "橙攻击力大幅提升", 2 to "橙咸鱼回血", 3 to "橙金币攻击", 4 to "橙回应吾！灵者之厄运！",
                5 to "橙首抽福利", 6 to "橙吞云吐月", 7 to "紫防御时恢复生命", 8 to "紫最大生命中幅提升",
                9 to "紫攻击力中幅提升", 10 to "攻击力小幅提升", 11 to "最大生命小幅提升", 12 to "生命高时攻击提升"
            )),
            "郭女王" to AgentAttr("", "", mapOf(
                1 to "橙攻击力大幅提升", 2 to "橙卡学历", 3 to "橙初始能量+2", 4 to "橙两声对",
                5 to "橙龙飞紫极", 6 to "橙我甄的宓了！", 7 to "紫初始能量+1", 8 to "紫最大生命中幅提升",
                9 to "紫攻击力中幅提升", 10 to "攻击力小幅提升", 11 to "最大生命小幅提升", 12 to "生命高时攻击提升"
            )),
            "蒯良" to AgentAttr("", "", mapOf(
                1 to "橙最大生命大幅提升", 2 to "橙端审谨言", 3 to "橙君子慎独", 4 to "橙祸福无门",
                5 to "橙因来果报", 6 to "紫初始能量+1", 7 to "紫防御时恢复生命", 8 to "紫最大生命中幅提升",
                9 to "紫生命高时提升攻击", 10 to "防御减伤提升", 11 to "最大生命小幅提升", 12 to "生命低时攻击提升"
            )),
            "曹丕" to AgentAttr("", "", mapOf(
                1 to "橙曳我裳", 2 to "橙受禅之刃", 3 to "橙猛气", 4 to "橙碧血",
                5 to "橙攻击力大幅提升", 6 to "紫普攻时恢复生命", 7 to "紫防御时恢复生命", 8 to "紫最大生命中幅提升",
                9 to "紫攻击力中幅提升", 10 to "最大生命小幅提升", 11 to "攻击力小幅提升", 12 to "生命高时攻击提升"
            )),
            "简雍" to AgentAttr("", "", mapOf(
                1 to "橙看着叫人火大", 2 to "橙赋闲返聘", 3 to "橙初始能量+2", 4 to "橙普攻伤害大幅增加",
                5 to "橙职场老人", 6 to "橙攻击力大幅提升", 7 to "紫普攻伤害中幅增加", 8 to "紫最大生命中幅提升",
                9 to "紫攻击力中幅提升", 10 to "最大生命小幅提升", 11 to "攻击力小幅提升", 12 to "生命高时攻击提升"
            )),
            "吕布" to AgentAttr("", "", mapOf(
                1 to "橙辕门射戟", 2 to "橙攻击力大幅提升", 3 to "橙豪杰纵横", 4 to "橙以战养战",
                5 to "橙马踏血泥", 6 to "橙骁骑赫怒", 7 to "紫攻击力中幅提升", 8 to "紫防御时恢复生命",
                9 to "紫最大生命中幅提升", 10 to "生命高时攻击提升", 11 to "最大生命小幅提升", 12 to "攻击力小幅提升"
            )),
            "周忠" to AgentAttr("", "", mapOf(
                1 to "橙攻击力大幅提升", 2 to "橙酣足", 3 to "橙治疗效果大幅提升", 4 to "橙初始能量+2",
                5 to "橙夜长梦多", 6 to "紫攻击力中幅提升", 7 to "紫治疗效果中幅提升", 8 to "紫最大生命中幅提升",
                9 to "孕蝶", 10 to "生命高时攻击提升", 11 to "最大生命小幅提升", 12 to "攻击力小幅提升"
            )),
            "刘璋" to AgentAttr("", "", mapOf(
                1 to "橙闭隘", 2 to "橙初始能量+3", 3 to "橙攻击力大幅提升", 4 to "橙大破敌",
                5 to "橙蜀道难", 6 to "紫普攻伤害中幅增加", 7 to "紫攻击力中幅提升", 8 to "紫防御时恢复生命",
                9 to "紫最大生命中幅提升", 10 to "最大生命小幅提升", 11 to "攻击力小幅提升", 12 to "生命高时攻击提升"
            )),
            "庞羲" to AgentAttr("", "", mapOf(
                1 to "橙羲和", 2 to "橙专权", 3 to "橙攻击力大幅提升", 4 to "橙事君同忧",
                5 to "橙日光", 6 to "橙临战", 7 to "紫攻击力中幅提升", 8 to "紫防御时恢复生命",
                9 to "紫最大生命中幅提升", 10 to "最大生命小幅提升", 11 to "攻击力小幅提升", 12 to "生命高时攻击提升"
            )),
            "钟繇" to AgentAttr("", "", mapOf(
                1 to "橙琴砚共依", 2 to "橙持节督军", 3 to "橙曲终阕尽", 4 to "橙悔作丝桐",
                5 to "橙馀弦更兴", 6 to "紫最大生命中幅提升", 7 to "紫技能伤害中幅增加", 8 to "紫初始能量+1",
                9 to "紫攻击力中幅提升", 10 to "最大生命小幅提升", 11 to "攻击力小幅提升", 12 to "生命低时攻击提升"
            )),
            "夏侯渊" to AgentAttr("", "", mapOf(
                1 to "橙出敌不意", 2 to "橙虎步关右", 3 to "橙恃勇身先", 4 to "橙攻击力提升12%",
                5 to "橙学法律学的", 6 to "橙攻城破阵", 7 to "紫防御时恢复生命", 8 to "紫最大生命中幅提升",
                9 to "紫攻击力中幅提升", 10 to "最大生命小幅提升", 11 to "攻击力小幅提升", 12 to "生命高时攻击提升"
            )),
            "程普" to AgentAttr("", "", mapOf(
                1 to "橙幽州肉搏战", 2 to "橙老铁", 3 to "橙金卫战意", 4 to "橙攻击力大幅提升",
                5 to "橙打铁", 6 to "紫技能伤害中幅增加", 7 to "紫最大生命中幅提升", 8 to "紫攻击力中幅提升",
                9 to "紫防御时恢复生命", 10 to "普攻伤害小幅增加", 11 to "攻击力小幅提升", 12 to "生命低时攻击提升"
            )),
            "SP陈登" to AgentAttr("", "", mapOf(
                1 to "橙雨顺物康", 2 to "橙河清海晏", 3 to "橙积善馀庆", 4 to "橙时和岁丰",
                5 to "橙初始能量+3", 6 to "紫初始能量+1", 7 to "紫防御时恢复生命", 8 to "紫最大生命值中幅提升",
                9 to "紫攻击力中幅提升", 10 to "生命低时攻击提升", 11 to "攻击力小幅提升", 12 to "普攻伤害小幅增加"
            )),
            "SP史子渺" to AgentAttr("", "", mapOf(
                1 to "橙初始能量+3", 2 to "橙仁心护持", 3 to "橙身魂俱殁", 4 to "橙念兹在兹",
                5 to "橙重灵降诛", 6 to "紫初始能量+1", 7 to "紫防御时恢复生命", 8 to "紫最大生命值中幅提升",
                9 to "紫攻击力中幅提升", 10 to "生命低时攻击提升", 11 to "攻击力小幅提升", 12 to "普攻伤害小幅增加"
            )),
            "马腾" to AgentAttr("", "", mapOf(
                1 to "橙初始能量+3", 2 to "橙纵骑驱骋", 3 to "橙荡荡如空", 4 to "橙地狱空",
                5 to "橙自彼氐羌", 6 to "紫初始能量+1", 7 to "紫防御时恢复生命", 8 to "紫最大生命值中幅提升",
                9 to "紫攻击力中幅提升", 10 to "生命低时攻击提升", 11 to "攻击力小幅提升", 12 to "普攻伤害小幅增加"
            )),
            "飞云" to AgentAttr("火", "龙盾")
        )
    }
